# IdeaStatiCa.ConnectionApi.Model.PolyLine2D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**StartPoint** | **Point2D** |  | [optional]
**Segments** | **List&lt;Segment2D&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)